Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
         = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-serverless-function-statecirculatingsupply"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "post-function"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-vmcirculatingsupply will be created
+ resource "kubernetes_manifest" "serverless_function-vmcirculatingsupply" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + access        = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateVMCirculatingSupplyInternal","id":42,"params":[[]]}')
                    EOT,
                ]
              + body_filter   = [
                  + <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"FilCirculating":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              + header_filter = [
                  + <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-serverless-function-vmcirculatingsupply"
              + namespace = "network"
            }
          + plugin     = "post-function"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + access        = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateVMCirculatingSupplyInternal","id":42,"params":[[]]}')
                    EOT,
                ]
              + body_filter   = [
                  + <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"FilCirculating":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              + header_filter = [
                  + <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-serverless-function-vmcirculatingsupply"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "post-function"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.circulating_supply will be created
+ resource "kubernetes_service" "circulating_supply" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-circulatingsupply"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_name                     = "circulatingsupply-prod.s3.amazonaws.com"
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + session_affinity                  = "None"
          + type                              = "ExternalName"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
          + port {
              + name        = "https"
              + node_port   = (known after apply)
              + port        = 443
              + protocol    = "TCP"
              + target_port = (known after apply)
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.circulating_supply_staging will be created
+ resource "kubernetes_service" "circulating_supply_staging" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-circulatingsupply-staging"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_name                     = "circulatingsupply-staging.s3.amazonaws.com"
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + session_affinity                  = "None"
          + type                              = "ExternalName"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
          + port {
              + name        = "https"
              + node_port   = (known after apply)
              + port        = 443
              + protocol    = "TCP"
              + target_port = (known after apply)
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.homepage will be created
+ resource "kubernetes_service" "homepage" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-homepage"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_name                     = "glif-static-website.s3-website-ap-northeast-1.amazonaws.com"
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + session_affinity                  = "None"
          + type                              = "ExternalName"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
          + port {
              + name        = "https"
              + node_port   = (known after apply)
              + port        = 443
              + protocol    = "TCP"
              + target_port = (known after apply)
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # module.ingress-kong_api-read-cache-dev-cache-8080[0].kubernetes_ingress_v1.ingress_kong will be updated in-place
~ resource "kubernetes_ingress_v1" "ingress_kong" {
        id     = "network/kong-api-read-cache-dev-8080-pxnzn"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "kubernetes.io/ingress.class" = "kong-internal-lb" -> null
                # (2 unchanged elements hidden)
            }
            name             = "kong-api-read-cache-dev-8080-pxnzn"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          + ingress_class_name = "kong-internal-lb"

            # (1 unchanged block hidden)
        }
    }

  # module.ingress-kong_api-read-dev-lotus-1234[0].kubernetes_ingress_v1.ingress_kong will be updated in-place
~ resource "kubernetes_ingress_v1" "ingress_kong" {
        id     = "network/kong-api-read-dev-lotus-1234-u59br"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "kubernetes.io/ingress.class" = "kong-internal-lb" -> null
                # (2 unchanged elements hidden)
            }
            name             = "kong-api-read-dev-lotus-1234-u59br"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          + ingress_class_name = "kong-internal-lb"

            # (1 unchanged block hidden)
        }
    }

  # module.ingress-kong_monitoring-80[0].kubernetes_ingress_v1.ingress_kong will be updated in-place
~ resource "kubernetes_ingress_v1" "ingress_kong" {
        id     = "monitoring/kong-monitoring-grafana-80-ivvix"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "kubernetes.io/ingress.class" = "kong-external-lb" -> null
                # (2 unchanged elements hidden)
            }
            name             = "kong-monitoring-grafana-80-ivvix"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          + ingress_class_name = "kong-external-lb"

            # (1 unchanged block hidden)
        }
    }

  # module.wallaby_test.uptimerobot_monitor.main will be created
+ resource "uptimerobot_monitor" "main" {
      + friendly_name = "wallaby.node.glif.io"
      + id            = (known after apply)
      + interval      = 1
      + status        = (known after apply)
      + type          = "http"
      + url           = "https://wallaby.node.glif.io/rpc/v0"
    }

  # module.api_gateway_kong_dev[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 32 to add, 7 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p k8s-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=glifio%252Ffilecoin-iac%252Fk8s%252Ffilecoin-dev-apn1-glif-eks)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p k8s-dev`
</details>
Plan: 32 to add, 7 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
